package com.kh.poly.pack1.dto.service;

public class 다형성 {
    /*
    多形性 (다형성 = polymorphism)
            多 많을 다 , 여러 가지 다양한 것을 의미
            形 모양 형 , 형태 모양 모습 등을 나타냄
            性 성품 성 , 본질 특성 성질을 의미

            하나의 성질이 여러가지 특성으로 나타나짐

            그리스어
            poly = 많은 다양한
            morphism = 형태 구조

            하나의 이름이나 형태가 다양한 동작으로 변화할 수 있는 성질

            컴파일 시간 다형성 : 메서드 오버로딩(Method Overloading)
                    메서드(기능)의 이름은 같지만, 매개변수의 개수나 타입이 다를 때 적용
                    Over- : 위에, 초과
                    Load  : 부담을 주다, 짐을 싣다

                    메서드(기능) 이름 하나에 여러가지 역할을 부여해서 과부하를 주는 것처럼 보이기때문에
                    붙인 이름

            실행 시간 다형성 : 메서드 오버라이딩(Method Overriding)
                    상속 관계에서 부모 클래스의 기능을 자식 클래스 다시 재정의해서 자신만의 동작으로
                    기능을 재설정할 때 사용
                    Over- : 위에, 초과
                    Ride  : 타다, 지배하다

                    위에서 덮어쓰다, 기존 것을 대체하다
                    기존의 동작을 덮어씌우고 새로운 동작을 정의하는 것에 유래
                    부모클래스에서 상속받은 동작을 자식클래스에서 재정의
                    상속을 받아서 상속받은 것을 사용
                    만약 ) 목소리, 재능, 현금
                            목소리 -> 부모님한테 받은 능력에서 내 능력으로 재탄생
                            재능  -> 부모님에게서 받은 능력에 내 능력으로 재탄생
                            상속  -> 부모님에게서 받은 재산, 유물 등 의 것을 내능력으로 소진시키거나 증가시켜 재탄생

     */
}

















