package com.kh.oop.methodex;

public class Void_Return_Parameters {
    /*
    parameters (媒介變數 = 매개변수 중간에 개입해서 변수를 두는 변수명)
        媒介變數 = 중매매 개입할개 변할변 셀수

    메서드 호출 시 전달된 데이터를 메서드 내부에서 사용하기 위한 변수명
    메서드가 외부 데이터를 받아 작업을 수행하도록 진행
    매개변수는 타입과 이름을 정의

                JavaScript = 변수명만 작성하면 ok
                function 기능명(매개변수명) {
                    //기능들작성
                }

                Java       = 타입명 변수명 모두 작성해야함
                public void  기능명(자료형 매개변수명) {
                    //기능들작성
                }
    void
        자바에서 메서드가 값을 반환하지 않을 때 사용
        어떤 작업을 수행하기만 하고 결과값을 호출한 쪽에 넘겨줄 필요가 없을 때 사용
        예를 들어, 화면에 메세지를 출력하거나 데이터를 저장하는 기능에서 주로 사용

    return
        메서드가 값을 호출한 쪽으로 반환할 때 사용
        반환된 값을 다른 메서드에서 활용하거나 변수에 저장할 수 있음
        반환 타입이 void가 아닌 경우 메서드 내부에 반드시 return 키워드가 있어야 함
        void 자리에 return으로 어떤 자료형을 반환하는지 자료형 작성
    */
}
