package com.kh;

public class 스택_힙 {
    /*
    * Stack과 Heap 이란?
    *   컴퓨터가 프로그램을 실행할 때 사용하는 두 가지 주요 메모리 공간
    *
    * Stack (스택)
    * 임시 작업 공간
    * 짧은 시간 동안 사용하는 데이터를 잠시 저장하는 공간
    *
    * ex)접시를 쌓는 곳처럼 데이터를 쌓았다가 하나씩 꺼내는 구조
    * 특징
    *   - 임시 저장소 : 함수 호출 중 만들어지는 변수(지역 변수)와 같은 데이터를 저장
    *   - 빠른 처리 : 데이터를 저장하고 삭제하는 속도가 빠름
    *   - 자동 관리 : 함수가 끝나면 변수도 자동으로 사라짐
    *   - 작은 크기 : 메모리 크기가 제한적
    *
    * Heap (힙)
    * 긴 시간 동안 사용하는 데이터 저장소
    * 프로그램 실행 중 필요할 때 메모리르 따로 요청해서 사용하는 공간
    *
    * ex)책상 위 큰 박스처럼 원하는 데이터를 저장하고 필요할 때 가져다 사용
    * 특징
    *   - 유연한 사용 : 배열, 객체 등 프로그램이 끝날 때 까지 사용해야하는 데이터를 저장
    *   - 크기가 큼 : 메모리 공간이 Stack보다 넓음
    *   - 수동 관리 : 데이터를 사용하지 않으면 직접 삭제나 참조 해제를 해야함
    *   - 속도 느림 : 데이터를 읽고 쓰는 속도가 Stack 보다 느림
    * */
}

















